figure(1)
plot(mean(price)) %取各日平均值，连线
hold on %添加其余线段
plot([51,678],[19.69,19.69],'r--'); %y=19.69(x∈[51,678]) 初始换股价格基准线,r--为颜色和样式，可以更改。
% r红色 k黑色 b蓝色 g绿色 y黄色 m洋红 w白色 --实线 --虚线 -.点划线
hold on
plot([452,452],[0,19.69],'m--') %x=452(y∈[0,19.69])  股价和换股价格交点的附注线
hold on
plot([678,678],[0,21],'k--') %交易日
hold off
box off %%去除右边及上面边框

%对于第一次到达16元的日期的分析
figure(2)
T=[]; %开辟用于记录数据的数组
for i1=1:500
    for j1=51:678 %遍历，如果满足条件则记录编号，并跳转到下一次实验
    if(price(i1,j1)>16)
        T=[T,j1];
        break;
    end
    end
end
fprintf('日期的峰度是%.2f\n',kurtosis(T)) %正态分布的峰度为3，若比3大很多，说明样本中含有较多远离均值的数据，因而峰度可用作衡量偏离正态分布的尺度之一 
boxplot(T) %画出箱线图  附注说明的图例等后期使用工具栏完成
fprintf('日期的下四分位数是%.2f\n',quantile(T,0.75))
fprintf('上边缘是%.2f\n',2.5*quantile(T,0.75)-1.5*quantile(T,0.25))

%对于满足回售条款的分析
figure(3)
ans=find(E==1); %找出满足回售条款的编号
ANS=price(ans,:);
ANS1=mean(ANS);
subplot(2,1,1) %将图分为2*1的两块，现在第一块中画出全部满足条件的曲线
title('满足回售条款的路径')
for i=1:357
plot(price(ans(i),:)) %将所有满足回售条款的路径都画出
hold on
end
plot([678-123,678],[26.58,26.58],'m--'); %1.35倍的换股价格的基准线
hold off
subplot(2,1,2)
title('满足回售条款的各日股价平均值的路径')
plot(ANS1)

figure(4)
for i=1:10 %取前十条曲线，将路径画出
plot(price(i,:))
hold on
end
h1=plot([51,678],[19.69,19.69],'r--');
h2=plot([51,678],[25.97,25.97],'y--');
h3=plot([555,678],[15.75,15.75],'b--');
legend([h1,h2,h3],'换股价格','赎回条款','回售条款');
box off
hold off

figure(5)
x=[1.35,1.5,1.6,1.7,1.8,1.9] %倍数的取值
y=[11.8,13,14,15,16,17,18,19.69] %下限的取值
[X,Y]=meshgrid(x,y) %做成一个包含所有组合情况的表格
Z=[6.5491,6.7589,6.7837,6.8216,6.8085,6.7715;
   6.4998,6.7566,6.7629,6.8552,6.7811,6.7143;
   6.4822,6.6851,6.7682,6.7082,6.6981,6.7112;
   6.4204,6.6532,6.6416,6.6765,6.6863,6.6491;
   6.4189,6.6109,6.6142,6.6271,6.6611,6.6468;
   6.4083,6.6172,6.5948,6.6146,6.6165,6.621;
   6.3977,6.5921,6.5995,6.573,6.584,6.5289;
   6.3605,6.5574,6.5372,6.5278,6.5149,6.4942]; %各种组合的结果
 xi=linspace(1.3,0.01,1.9);
 yi=linspace(11,0.1,19.69); %将上述的范围的取值间隔缩小 
 [Xi,Yi]=meshgrid(xi,yi);
 Zi=interp2(X,Y,Z,Xi,Yi); %对最终收益进行拟合
 surf(Xi,Yi,Zi)%将拟合后的结果连线


